; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph2 - mode
	infrared1 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation4 - direction
	Star8 - direction
	Star10 - direction
	GroundStation13 - direction
	Star2 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	Star11 - direction
	Star6 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation12)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
)
(:goal (and
	(pointing satellite0 GroundStation13)
	(have_image Planet14 infrared0)
	(have_image Phenomenon15 thermograph2)
	(have_image Star16 infrared1)
	(have_image Phenomenon17 infrared0)
	(have_image Phenomenon18 infrared0)
))

)

; plan
1. (turn_to satellite0 groundstation12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation12)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 groundstation12)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon17 groundstation12)
   deleted: (pointing satellite0 groundstation12)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon17 instrument1 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon15 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon15 instrument1 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon18 instrument1 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 3 of 6
10. (turn_to satellite0 planet14 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet14)
   goals met: 3 of 6
11. (take_image satellite0 planet14 instrument1 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 4 of 6
12. (turn_to satellite0 star16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star16)
   goals met: 4 of 6
13. (take_image satellite0 star16 instrument1 infrared1)
   added: (have_image star16 infrared1)
   goals met: 5 of 6
14. (turn_to satellite0 groundstation13 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation13)
   goals met: 6 of 6
